snlkuharlocal/src/Catalogs/ФР_ПакетыДанных/ФР_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФР_ПакетыДанных</name>
  <attributes>
    <name>ДанныеПакета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиПакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Пакета</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Сеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <comment>Загрузка-Выгрузка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектовВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибокЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПакет</name>
    <type>
      <types>CatalogRef.ФР_ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПорядка</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиПакета</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыПакета</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ОперВыгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ФР_ПакетыДанных/Forms/ФормаЗагрузкиПакетов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПланОбмена = МаркировкаКС.ПолучитьЗначениеПараметра(ЭтотОбъект.Параметры, "ПланОбмена");
	Если ЗначениеЗаполнено(ПланОбмена) Тогда		
		ВыбУзелОбмена = Маркировка_ПИ.ЭтотУзел(ПланОбмена);
	Иначе
		ВыбУзелОбмена = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогПакетов_НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	мКаталогЗагрузки = ВыборКаталога_(КаталогЗагрузки);
	Если ЗначениеЗаполнено(мКаталогЗагрузки) Тогда   
		КаталогЗагрузки = мКаталогЗагрузки;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыборКаталога_(Каталог, ПроверятьСуществование = Истина)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВФ = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогВФ.Заголовок						=	"Выберите каталог содержащий пакеты обмена";
	ДиалогВФ.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	ДиалогВФ.Каталог						= 	Каталог;
	
	Результат = "";  
	Если ДиалогВФ.Выбрать() Тогда
		Результат = ДиалогВФ.Каталог;	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ВыборКаталога_(Каталог, ПроверятьСуществование = Истина)

&НаКлиенте
Процедура ЗагрузитьПакеты(Команда)
	Если ЗначениеЗаполнено(КаталогЗагрузки) Тогда     
		МаскаФайлов = СтрШаблон("Msg_*_%1_*.dd", СокрЛП(ПолучитьРеквизитШапки(ВыбУзелОбмена, "Код")));
		
		Файлы = НайтиФайлы(КаталогЗагрузки, МаскаФайлов);
		Если Файлы.Количество() > 0 Тогда
			Для Каждого Файл Из Файлы Цикл
				рЗагрузки = Справочники.ФР_ПакетыДанных.ПрочитатьПакет(Новый ДвоичныеДанные(Файл.ПолноеИмя));	
				Если рЗагрузки.Успешно Тогда				
					Сообщить("Загружен пакет: " + рЗагрузки.Данные, СтатусСообщения.Важное);				
				Иначе
					МаркировкаКС.ВывестиОшибки(рЗагрузки);
				КонецЕсли;
			КонецЦикла;
		Иначе      
			Сообщить(СтрШаблон("В каталоге: '%1' не найдено файлов по маске: '%2' !", КаталогЗагрузки, МаскаФайлов), СтатусСообщения.Важное);
		КонецЕсли;				
	Иначе
		Сообщить("Не указан каталог загрузки !", СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры
